[
  {
    "id": 1,
    "name": "初心与使命：建党伟业探寻之旅",
    "name_en": "The Founding Mission: A Journey to Explore the Party's Establishment",
    "description": "本路线串联了中国共产党诞生的核心地点与重要人物的故居，带您回顾建党初期的峥嵘岁月。",
    "description_en": "This route connects the core site of the birth of the CPC and the former residences of important figures, taking you back to the momentous years of the Party's founding.",
    "theme": "一日游",
    "attraction_ids": [
      1,
      3,
      2
    ]
  },
  {
    "id": 2,
    "name": "革命先烈缅怀之旅",
    "name_en": "A Journey to Commemorate Revolutionary Martyrs",
    "description": "从龙华烈士陵园到一大会址，本路线旨在缅怀为革命事业英勇献身的先烈们，感受今日幸福生活的来之不易。",
    "description_en": "From Longhua Martyrs' Cemetery to the site of the First National Congress, this route aims to commemorate the martyrs who sacrificed their lives for the revolution and to appreciate the hard-won happiness of today.",
    "theme": "半日游",
    "attraction_ids": [
      2,
      1
    ]
  },
  {
    "name": "上海经典一日游",
    "name_en": "Classic Shanghai One-Day Tour",
    "description": "本路线带您领略上海最具代表性的两个景点：外滩的万国建筑博览群和豫园的古典园林之美。",
    "description_en": "This route shows you two of the most representative attractions in Shanghai: the exotic building clusters on the Bund and the beauty of classical gardens in Yu Garden.",
    "theme": "一日游",
    "attraction_ids": [
      4,
      5
    ],
    "id": 3
  },
  {
    "name": "黄浦江畔红色漫步",
    "name_en": "Red Walk Along the Huangpu River",
    "description": "从党的诞生地出发，漫步至外滩，感受上海的红色历史与现代都市的交融。",
    "description_en": "Starting from the birthplace of the Party and strolling to the Bund, experience the blend of Shanghai's red history and modern metropolis.",
    "theme": "半日游",
    "attraction_ids": [
      1,
      4
    ],
    "id": 4
  },
  {
    "id": 5,
    "name": "初心与使命：星火燎原·黄浦红色基因解码之旅",
    "name_en": "Original Mission: Decoding the Red Gene of Huangpu",
    "description": "本路线从党的诞生地出发，串联起中国工人运动的重要地标，解码上海作为革命发源地的红色基因。",
    "description_en": "Starting from the birthplace of the Party, this route connects important landmarks of the Chinese workers' movement, decoding the red gene of Shanghai as a revolutionary cradle.",
    "theme": "半日游",
    "attraction_ids": [
      1,
      6,
      7
    ]
  },
  {
    "id": 6,
    "name": "真理之光·马克思主义传播轨迹",
    "name_en": "The Light of Truth: The Trajectory of Marxism's Spread",
    "description": "本路线聚焦于法租界内的几个关键地点，展示马克思主义如何在上海完成“理论→出版→组织”的完整传播链条。",
    "description_en": "Focusing on several key locations within the former French Concession, this route showcases how Marxism completed the entire chain of \"Theory -> Publication -> Organization\" in Shanghai.",
    "theme": "半日游",
    "attraction_ids": [
      8,
      9,
      10
    ]
  }
]